#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ИдентификаторГруппыДляОповещения.Значение КАК ИдентификаторГруппы,
		|	ВКМ_ТокенУправленияТелеграмБотом.Значение КАК Токен,
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.Текст КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка КАК Ссылка
		|ИЗ
		|	Константа.ВКМ_ТокенУправленияТелеграмБотом КАК ВКМ_ТокенУправленияТелеграмБотом,
		|	Константа.ВКМ_ИдентификаторГруппыДляОповещения КАК ВКМ_ИдентификаторГруппыДляОповещения,
		|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		chat_id = ВыборкаДетальныеЗаписи.ИдентификаторГруппы;
		text = ВыборкаДетальныеЗаписи.ТекстСообщения;
		token = ВыборкаДетальныеЗаписи.Токен;
		
		Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
		
		Данные = Новый Структура;
		Данные.Вставить("text", text);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовок = Новый Соответствие();
		Заголовок.Вставить("Content-Type", "application/json");
		
		СтрокаЗапроса = "bot" + token + "/sendMessage?chat_id=" + Формат(chat_id, "ЧГ=");
		
		HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовок);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если Результат.КодСостояния = 200 Тогда
		
			Попытка	
				Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Объект.Удалить();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru= 'Отправка уведомлений Телеграм-боту'"),
				УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		Иначе
			
			ВызватьИсключение "Ошибка проверки связи";
			
		КонецЕсли;
		
		Возврат;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
