
#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УсловноеОФормление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьДниОтпуска ();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьДниОтпуска ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДиаграммаГанта(Команда)
	
	СтрутураПараметров = Новый Структура;
	СтрутураПараметров.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", СтрутураПараметров, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	ОтпускаСотрудников = Объект.ОтпускаСотрудников.Выгрузить();
	
	Адрес = ПоместитьВоВременноеХранилище(ОтпускаСотрудников, ЭтаФорма.УникальныйИдентификатор); 
	Возврат Адрес; 
	
КонецФункции

&НаКлиенте
Процедура РассчитатьДниОтпуска ()
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ТекущиеДанные.ДнейОтпуска = День(ТекущиеДанные.ДатаОкончания) - День(ТекущиеДанные.ДатаНачала);
	
КонецПроцедуры

Процедура УсловноеОФормление()
	
	УсловноеОформление.Элементы.Очистить();
	
	МассивИменКолонокДляПодсветки = Новый Массив;
	
    Для каждого Стр из Элементы.ОтпускаСотрудников.ПодчиненныеЭлементы Цикл
        МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
    КонецЦикла;
    
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Зеленый);
    
    ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.ДнейОтпускаПлан");
    ЭлементУсловия.ПравоеЗначение = 28;
    ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
    ЭлементУсловия.Использование  = Истина;
    
    Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
        ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
        ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);
    КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
