
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьГруппуДоговорАбонентскоеОбсдуживание();
		
	ДобавитьГруппуПериодДействия();
	ДобавитьПолеДатаНачалаДействияДоговора();
	ДобавитьПолеДатаОкончанияДействияДоговора();
		
	ДобавитьГруппуДанныеДоговора();
	ДобавитьПолеСуммаАбонентскойПлаты();
	ДобавитьПолеСтоимостьЧасаРаботы();
	
КонецПроцедуры

Процедура ДобавитьГруппуДоговорАбонентскоеОбсдуживание();
	Группа = Элементы.Добавить("ГруппаДоговорАбонентскоеОбсдуживание", Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "ГруппаДоговорАбонентскоеОбсдуживание";
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
КонецПроцедуры	

Процедура ДобавитьГруппуПериодДействия();
	Группа = Элементы.Добавить("ГруппаПериодДействия", Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "ГруппаПериодДействия";
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
КонецПроцедуры	

Процедура ДобавитьГруппуДанныеДоговора();
	Группа = Элементы.Добавить("ГруппаДанныеДоговора", Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок = "ГруппаДанныеДоговора";
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
КонецПроцедуры

Процедура ДобавитьПолеДатаНачалаДействияДоговора()
	Если Элементы.Найти("ДатаНачалаДействияДоговора") = Неопределено Тогда
		ЭлементДатаНачалаДействияДоговора = Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
		ЭлементДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДействияДоговора.Заголовок = "Договор действует с"; 
		ЭлементДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		ЭлементДатаНачалаДействияДоговора.Заголовок = "ДатаНачалаДействияДоговора";
	КонецЕсли;	
КонецПроцедуры 

Процедура ДобавитьПолеДатаОкончанияДействияДоговора()
	Если Элементы.Найти("ДатаОкончанияДействияДоговора") = Неопределено Тогда
		ЭлементДатаОкончанияДействияДоговора = Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
		ЭлементДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода; 
		ЭлементДатаОкончанияДействияДоговора.Заголовок = "Договор действует по"; 
		ЭлементДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		ЭлементДатаОкончанияДействияДоговора.Заголовок = "ДатаОкончанияДействияДоговора";
	КонецЕсли;	
КонецПроцедуры

Процедура ДобавитьПолеСуммаАбонентскойПлаты()
	Если Элементы.Найти("СуммаАбонентскойПлаты") = Неопределено Тогда
		ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Элементы.ГруппаДанныеДоговора);
		ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСуммаАбонентскойПлаты.Заголовок = "Абонентская плата";
		ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		ЭлементСуммаАбонентскойПлаты.Заголовок = "СуммаАбонентскойПлаты";
	КонецЕсли;	
КонецПроцедуры 
 
Процедура ДобавитьПолеСтоимостьЧасаРаботы()
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Элементы.ГруппаДанныеДоговора);
		ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
		ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		ЭлементСтоимостьЧасаРаботы.Заголовок = "СтоимостьЧасаРаботы";
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ИзменитьФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьФорму(ЭтотОбъект)
	Если ЭтотОбъект.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ЭтотОбъект.Элементы.ДатаНачалаДействияДоговора.Видимость = Истина;
		ЭтотОбъект.Элементы.ДатаОкончанияДействияДоговора.Видимость = Истина;
		ЭтотОбъект.Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
		ЭтотОбъект.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		ЭтотОбъект.Элементы.ДатаНачалаДействияДоговора.Видимость = Ложь;
		ЭтотОбъект.Элементы.ДатаОкончанияДействияДоговора.Видимость = Ложь;
		ЭтотОбъект.Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
		ЭтотОбъект.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
